<?php

$lang['Tech']         = "科技";
$lang['Requirements'] = "需求";
$lang['Metal']        = "金属";
$lang['Crystal']      = "晶体";
$lang['Deuterium']    = "重氢";
$lang['Energy']       = "能源";
$lang['Message']      = "讯息";
$lang['level']        = "等级";
$lang['treeinfo']     = "[i]";
$lang['comingsoon']   = "Bientot";
$lang['te_dt_tx_pre'] = "基本要求";


$lang['type_mission'][1]  = "攻击";
$lang['type_mission'][2]  = "联合攻击";
$lang['type_mission'][3]  = "运输";
$lang['type_mission'][4]  = "防御";
$lang['type_mission'][5]  = "联合防御";
$lang['type_mission'][6]  = "侦查";
$lang['type_mission'][7]  = "殖民";
$lang['type_mission'][8]  = "回收";
$lang['type_mission'][9]  = "导弹攻击";
$lang['type_mission'][15] = "探险";

// Short names for fight rapport
$lang['tech_rc'] = array (
202 => '小型运输舰',
203 => '大型运输舰',
204 => '轻型战斗机',
205 => '重型战斗机',
206 => '巡洋舰',
207 => '战列舰',
208 => '殖民船',
209 => '回收船',
210 => '间谍卫星',
211 => '导弹舰',
212 => '太阳能卫星',
213 => '毁灭者',
214 => '死星',
215 => '战斗巡洋舰',

401 => '飞弹发射器',
402 => '轻型雷射炮',
403 => '重型雷射炮',
404 => '高斯炮',
405 => '中子炮',
406 => '等离子武器',
407 => '小型防护圆顶',
408 => '大型防护圆顶',
);

$lang['tech'] = array(
  0 => "星球建筑",
  1 => "金属矿",
  2 => "晶体矿",
  3 => "重氢同步分离器",
  4 => "太阳能发电厂",
 12 => "核融合发电厂",
 14 => "机器人工厂",
 15 => "奈米机器人工厂",
 21 => "造船厂",
 22 => "金属储存器",
 23 => "晶体储存器",
 24 => "重氢储存槽",
 31 => "研究实验室",
 33 => "地形改造器",
 34 => "联盟太空站",

 40 => '月面建筑',
 41 => '月球基地',
 42 => '感应密集阵',
 43 => '空间跳跃门',

 44 => "导弹发射井",

// Technologies
100 => '科技研究',
106 => '间谍探测技术',
108 => '电脑技术',
109 => '武器技术',
110 => '防御盾系统',
111 => '船舰装甲化',
113 => '能量技术',
114 => '超空间科技',
115 => '燃烧引擎',
117 => '脉冲引擎',
118 => '超空间引擎',
120 => '雷射技术',
121 => '中子技术',
122 => '等离子技术',
123 => '跨银河研究网路',
124 => '探险技术',
199 => '引力研究',

200 => '战舰',
202 => '小型运输舰',
203 => '大型运输舰',
204 => '轻型战斗机',
205 => '重型战斗机',
206 => '巡洋舰',
207 => '战列舰',
208 => '殖民船',
209 => '回收船',
210 => '间谍卫星',
211 => '导弹舰',
212 => '太阳能卫星',
213 => '毁灭者',
214 => '死星',
215 => '战斗巡洋舰',

400 => '防御',
401 => '飞弹发射器',
402 => '轻型雷射炮',
403 => '重型雷射炮',
404 => '高斯炮',
405 => '中子炮',
406 => '等离子武器',
407 => '小型防护圆顶',
408 => '大型防护圆顶',
502 => '拦截导弹',
503 => '星际导弹',

600 => "高级指挥官",
601 => "地质学家",
602 => "海军上将",
603 => "工程师",
604 => "技术专家",
605 => "建造专家",
606 => "科学家",
607 => "仓库管理员",
608 => "防御学家",
609 => "地堡专家",
610 => "间谍",
611 => "指挥官",
612 => "将军",
613 => "总理",
614 => "帝国君王",
615 => "袭击专家"

);

$lang['res']['descriptions'] = array(
1 => "金属采矿场提供了帝国所需的基本资源——金属，而且可以被用来建造建筑物和宇宙飞船。",
2 => "晶体矿是生产精密电子元件和生产高级合金的主要资源之一。",
3 => "重氢是星际飞船的燃料，可以从深海中提取。重氢属于稀有物质，相当珍贵而且重要。",
4 => "太阳能发电站将恒星带来的光子能量转换为电力以提供几乎所有的建筑物使用，特别是相当耗费能量的资源建筑。",
12 => "核电场是星际时代重要的能量供给建筑，通过消耗一定的重氢能量，他可以提供相当庞大的电量。级别越高，消耗重氢的速度和提供的电量就越快和越大.",
14 => "机器人是星际时代的主要工人，他可以提供便宜且高效的劳动力用于基础建设。级别越高，建筑物建造的速度也就越快.",
15 => "当机器人的发展进入了纳米时代，他可以使建造基础建筑，防御建筑以及飞船的速度得到加快。每一级别的提升都会带来更快的建造速度。",
21 => "所有宇宙飞船都必须在造船场里进行建造，他是星际时代最基础，也是不可缺的建筑。",
22 => "随着金属矿的仓库的建造，我们可以储存更多的金属矿了。",
23 => "晶体矿仓库使的我们有更多的地方来放置这种重要物资。",
24 => "随着该建筑的建造，我们可以储存更多的重氢资源。",
31 => "研究实验室是星际殖民者重要的建筑之一，而它所研究的科技决定了一个殖民的实力究竟如何。",
33 => "它的出现可以为你提供15个单位额外的建造面积，现在，行星上有更多位置来建造建筑物了。",
34 => "联盟太空站允许友好舰队停泊在轨道上空以协助防御，并提供舰队所需的燃料。",
41 => "月球没有空气，要移民月球必须先造一个月球基地，基地的等级越高，提供生存必需的面积也就越大。每一级提升都可以增加额外的覆盖面积。",
42 => "感应阵可以用来感应到在遥远星系的舰队的运动情况，但耗能相当庞大。",
43 => "空间传送门是巨大的传输工具，能够使庞大的舰队瞬间穿越星系。空间传送门运用了近似虫洞的科技来实现跳跃，不需要重氢。",
44 => "导弹发射井是用来存放导弹。",

106 => "空间探测技术决定了一个殖民者对外界，包括对敌人的殖民星的了解程度。级别越高，在探测对方时取得的资料也就越多。",
108 => "计算机技术的提高，使得殖民者可以同时指挥更多的舰队外出战斗，每提升一级科技，同时所派遣执行任务的舰队数量便加一。",
109 => "武器技术决定了一个殖民者的战斗能力究竟如何。武器技术的提升，可以使殖民者拥有更强力的武器，并且增加所有武器的破坏力，每一级的提升将带来１０％的额外攻击能力。",
110 => "星际战斗中，能量盾防御系统会起到非常重要的作用，它可以吸收敌人的伤害，以减少自己舰船的损失。每一级提升都会使能量盾总额在基础上提升１０％。",
111 => "装甲是舰船最后的防御力量，装甲技术的提升可以使合金的防御能力得到更好的优化。每一级装甲防御技术的提升都可以使得装甲防御力提高１０％。",
113 => "能量技术是很多不同技术的基础，这是一个必须重视的基础科技。",
114 => "通过４维和５维空间技术的结合，使发明一种新的更节能和更高效的空间移动技术成为了可能。这是一种重要的空间科技。",
115 => "基于反作用原理，燃烧引擎是最古老的引擎类型。该技术的提升使的一些舰船的移动能力得到加强，每一级可以加快１０％的速度。",
117 => "脉冲引擎基于反作用力的原理而设计。与简单的燃烧引擎比较之下，脉冲引擎更为先进，可以用较少的燃料消耗量获得较高的速度。每升一级可以提高２０％的速度。",
118 => "通过对时间和空间的弯曲从而使船舰周围的空间进行压缩，从而使飞行的距离减少。这项技术水平越高，空间压缩的也越剧烈，从而达到提高速度的目的。每升一级在基础数值上，提高速度的３０％。",
120 => "激光技术使激光当射到某一个目标上时，造成伤害。",
121 => "中子技术使离子进行加速，形成一道毁灭性的光线，并且可以产生相当大的破坏力。",
122 => "等离子科技实质上是介乎于激光科技和中子科技两种概念之的一种科技，他可以产生一道高能射线，像武器一样具有破坏力。",
123 => "你的星球上的科学家可以经由网络互相通信。每提升一个等级，网络会自动将未连线的研究实验室加入网路中。在连线建立后，它们的等级会相加。每个连结中的研究实验室都需要有相应的等级以加入研究。只要等级足够，研究实验室会各自分担工作，效率就像它们被相加一样。",
124 => "舰船可以配备一个研究模块，使数据备份的过程中收集来自远征的未知区域宇宙中的信息。",
199 => "通过发射密集的重力微粒，人工的重力场被制造出来，其能量和吸引力不只可以摧毁船舰，甚至是月球。为了产生足够的重力微粒，需要大量的能量。只有最强大的殖民者才能研究这种技术。",

202 => "行星与行星之间的距离是非常大的，你需要一个飞船来帮你把物资进行转移。当然，这不仅仅是在你不同的殖民地之间进行的活动，也包括从敌人的殖民星到你自己的殖民星之间的进行物资转移。",
203 => "老式运输船实在太小了点，你需要一个具有更大载物空间的飞船。现在，你可以拥有它了！它的装载量是老式的５倍，并且速度更快。",
204 => "这种轻型战斗机是宇宙中最低级的战斗飞行器，但在初期，有，总比没有好嘛。",
205 => "这种飞机比前一种更强大了，当你能建造这种飞机的时候，应该立刻放弃轻型战斗机。",
206 => "当星辰级巡洋舰出现的时候，那些借自己弱小防御来妄图抵挡战斗机的敌人们必将陷入绝望之中。这是一种中等级别飞船，也是在初级和中级殖民者之间最常见的。",
207 => "当你想成为一个更强大的殖民者时，你必须建造这种战列舰。暴风级战列舰如其名，如暴风一般将所有试图顽抗的敌人摧毁，他是主力战舰之一。",
208 => "没有合适的交通工具，你是不能殖民其他星球的。殖民船除了运载那些拓荒者外，还能携带少量的资源，但是不会很多。",
209 => "在一场激烈的战斗进行完毕后，回收船会将战场打扫的干干净净。",
210 => "知己知彼，百战百胜。事实上，在星际的战场上，这句话也是相当流行的。空间探测器是星际时代最好的侦察兵。",
211 => "轰炸机会给敌人的防御带来火山爆发一般的毁灭力。",
212 => "太阳能卫星其实是太阳能发电厂的变种，它运行在轨道上，并且给行星带来电力能量。太阳能卫星的效率取决于太阳光线的强弱。但请记住，它是可摧毁的，并且极易被摧毁。",
213 => "毁灭者是战斗船舰中的王者。由离子-等离子及高斯加农炮构筑而成的多重武器方阵搭载在能快速反应的炮台上，破坏力非常惊人。",
214 => "再也没有什么东西能跟最危险的死亡之星比拚破坏力了。他容量庞大，威力恐怖，但值得庆幸的是，他的移动速度非常缓慢。",
215 => "战斗巡洋舰对敌方重型舰艇来说是死亡舰艇。由于他的小型化设计跟精密的武器设计,使得他只能拥有最小型的货舱，相对的他可以使用燃料消耗较少的超空间引擎，以及使得它可以在一瞬间摧毁大量的重型舰艇而在战斗中占有一定的优势地位。",

401 => "地对空火箭发射器是最初级的防御建筑拉，很脆弱，但有总比没有好。",
402 => "轻型激光发射器具有一定的破坏力，对敌方的战斗机有一定的威胁力，但这并不强。",
403 => "重型激光发射平台是前者的进化升级加强版，威力更大，射速更快。",
404 => "高斯炮就是一座大型的粒子加速器，成吨重的炮弹被巨大的电磁场加速，破坏力足以击穿任何现代的装甲，防护盾被击穿也不是少数例子。有时甚至能把目标直接打个对穿。",
405 => "毫无疑问，中子炮是一种威力强大的防御建筑，他的威慑力可以维护一颗普通行星的安全。",
406 => "在激光技术达到顶峰时，人们将等离子武器发明了出来，虽然当它发射时，外表相当美丽，但他的攻击力是不容质疑的。只有两个字——变态。",
407 => "小型能量防御罩在构建防御系统时，用来吸收攻击者舰队的伤害，不过，不要对它抱有太大的希望。",
408 => "大型能量防御罩的防御力更强，可以吸收更多的伤害。",
502 => "拦截导弹能拦截并摧毁进攻的星际导弹。每一枚拦截导弹可以摧毁一枚星际导弹。",
503 => "星际导弹是很好用的星际武器。被星际导弹摧毁的地方防御不能再修复。",

);

// Created by Perberos. All rights reversed (C) 2006
// Complet by XNova Team. All rights reversed (C) 2008
?>